In [1]:
#Pandas库的数据类型运算
    #算数运算法则：
    #算数运算根据行列索引，自动补齐后运算，运算默认产生浮点数
    #补齐时缺项填充NAN(空值)
    #二维和一维、一维和零维间为广播运算
    #采用+-*/符号进行的二元运算产生新的对象

In [3]:
import pandas as pd
import numpy as np
a = pd.DataFrame(np.arange(12).reshape(3,4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [5]:
b = pd.DataFrame(np.arange(20).reshape(4,5))
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [6]:
a+b

      0     1     2     3   4
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [11]:
a*b

      0     1      2      3   4
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [13]:
c = pd.Series(np.arange(4))
c

0    0
1    1
2    2
3    3
dtype: int64

In [14]:
c - 10

0   -10
1    -9
2    -8
3    -7
dtype: int64

In [15]:
b - c #不同维度间为广播运算，一维Series默认在1轴参与运算(也就是说b中的每一行都跟c发生运算)

      0     1     2     3   4
0   0.0   0.0   0.0   0.0 NaN
1   5.0   5.0   5.0   5.0 NaN
2  10.0  10.0  10.0  10.0 NaN
3  15.0  15.0  15.0  15.0 NaN

In [16]:
b.sub(c,axis=0)#使用运算方法可以令一维Series参与0轴运算

    0   1   2   3   4
0   0   1   2   3   4
1   4   5   6   7   8
2   8   9  10  11  12
3  12  13  14  15  16

In [8]:
#方法形式的运算
    #.add(d,**argws):类型间加法运算，可选参数
    #.sub(d,**argws):类型间减法运算，可选参数
    #.mul(d,**argws):类型间乘法运算，可选参数
    #.div(d,**argws):类型间除法运算，可选参数

In [9]:
b.add(a,fill_value=100)#fill_value参数替代NAN，替代后参与运算

       0      1      2      3      4
0    0.0    2.0    4.0    6.0  104.0
1    9.0   11.0   13.0   15.0  109.0
2   18.0   20.0   22.0   24.0  114.0
3  115.0  116.0  117.0  118.0  119.0

In [10]:
a.mul(b,fill_value=0)

      0     1      2      3    4
0   0.0   1.0    4.0    9.0  0.0
1  20.0  30.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [17]:
    #比较运算法则：
    #比较运算只能比较相同索引的元素，不进行补齐
    #二维和一维、一维和零维间为广播运算
    #采用><>=<===!=等符号进行的二元运算产生布尔对象

In [18]:
a = pd.DataFrame(np.arange(12).reshape(3,4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [21]:
d = pd.DataFrame(np.arange(12,0,-1).reshape(3,4))
d

    0   1   2  3
0  12  11  10  9
1   8   7   6  5
2   4   3   2  1

In [22]:
a > d #同维度运算，要求尺寸一致。

       0      1      2      3
0  False  False  False  False
1  False  False  False   True
2   True   True   True   True

In [23]:
a == d

       0      1      2      3
0  False  False  False  False
1  False  False   True  False
2  False  False  False  False

In [25]:
c

0    0
1    1
2    2
3    3
dtype: int64

In [26]:
a > c #不同维度，广播运算，默认在1轴

       0      1      2      3
0  False  False  False  False
1   True   True   True   True
2   True   True   True   True

In [27]:
c > 0

0    False
1     True
2     True
3     True
dtype: bool

In [ ]:
#总结：
    #Series = 索引 + 一维数据
    #DataFrame = 行列索引 + 二维数据
#理解数据类型与索引的关系，操作索引即操作数据
#重新索引、数据删除、算数运算、比较运算
#像对待单一数据一样对待Series和DataFrame对象